# DelName

## Description
Procedure DelName deletes an object name from a Vectorworks document. The associated object is not affected by the name deletion.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE DelName(name : STRING);
```

```python

def vs.DelName(name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Object name to be deleted.|

## Version
Availability: from MiniCAD
## Category
* Object Names